tests/testCases/test2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.01

writeControl    runTime;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

}

// to debug
/*
InfoSwitches
{
    writePrecision  6;
    writeJobInfo    1;
    writeDictionaries 1;
    writeOptionalEntries 1;

    // Allow case-supplied C++ code (#codeStream, codedFixedValue)
    allowSystemOperations   1;
}
*/

// look at DebugSwitches @ $WM_PROJECT_DIR/etc/controlDict

DebugSwitches
{
//   wallModel           1;
//   LOTWWallModel    1;
//   LawOfTheWall     2;
//    Spalding   2;

//   ODEWallModel  2;
//   EquilibriumODEWallModel  2;

//   JohnsonKing 1;
}



libs (
    "libOpenFOAM.so"
    "libWallModelledLES.so"
     );

// ************************************************************************* //
