tests/testCases/test2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       201;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       231;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9;
        startFace       261;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9;
        startFace       270;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       279;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       309;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
)

// ************************************************************************* //
