tests/testCases/test2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    bottomWall
    {
         
        type		        LOTWWallModel;
        value			uniform 1;  //redundant

        RootFinder
        {
            type    Newton;
            eps     0.01;
            maxIter 10;
        }

        Law
        {
            type    Spalding;
            //type    WernerWengle;
            kappa   0.4;
            B       5.5;
        }
     
     /* 
        type	EquilibriumODEWallModel;
        value   uniform 1;  //redundant
        maxIter   10;
        eps       1e-3;
        nMeshY    5;
       
        EddyViscosity
        {
             type    JohnsonKing;
             APlus   17.8;
             kappa   0.39;
        }
    */ 
    /*
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.42;
        E               8.52;
        value           uniform 0;
   */     
    }

    topWall
    {
    /*
        type	        nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.42;
        E               8.52;
        value		uniform 0;
    */
      
        type    EquilibriumODEWallModel;
        value   uniform 1;  //redundant
        maxIter   10;
        eps       1e-3;
        nMeshY    5;

        EddyViscosity
        {
             type    JohnsonKing;
             APlus   17.8;
             kappa   0.39;
        }
    
    /*
        type                    LOTWWallModel;
        value                   uniform 1;  //redundant

        RootFinder
        {
            type    Newton;
            eps     0.01;
            maxIter 10;
        }

        Law
        {
            type    Spalding;
            //type    WernerWengle;
            kappa   0.4;
            B       5.5;
        }
    */
    }

    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
