tests/testCases/test2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
    {
      solver     GAMG;
      tolerance 1e-06;
      relTol     0.01;
      smoother  DIC; 
      cacheAgglomeration true;
      nCellsInCoarsestLevel 10;
      agglomerator faceAreaPair;
      mergeLevels   1;
    }
  pFinal
    {
      $p;
      smoother   DICGaussSeidel;
      relTol     0;
      smoother   DIC;
    }

    "(U|k)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k)Final"
    {
        $U;
        reTol 0;
    }

/*    "(U|k)"
    {
        solver          smoothSolver;
        smoother  symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
*/
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        1;
    pRefValue       0;
}


// ************************************************************************* //
